tap "homebrew/bundle"
tap "homebrew/services"
tap "mczachurski/wallpapper"

brew "brotli"
brew "curl"
brew "dbus"
brew "entr"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git"
brew "git-delta"
brew "pkg-config"
brew "graphicsmagick"
brew "jpegoptim"
brew "jq"
brew "make"
brew "mkcert"
brew "node"
brew "optipng"
brew "pandoc"
brew "pipx"
brew "python@3.12", link: true
brew "trash"
brew "typst"
brew "wget2"
brew "woff2"
brew "yt-dlp"
brew "zola"
brew "mczachurski/wallpapper/wallpapper"
