# vim: set syntax=ruby:

tap "homebrew/bundle"
tap "homebrew/services"
tap "mczachurski/wallpapper"
tap "sass/sass"

# brew "bat" # disabled until the dark-light mode pr is merged and released
brew "brotli"
brew "cmake"
brew "csvlens"
brew "curl"
brew "dbus"
brew "dos2unix"
brew "entr"
brew "eza"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git-delta"
brew "git"
brew "graphicsmagick"
brew "jpegoptim"
brew "jq"
brew "less"
brew "lesspipe"
brew "libzen" # needed for egui apps
brew "make"
brew "mczachurski/wallpapper/wallpapper"
brew "mdcat"
brew "mkcert"
brew "neovim"
brew "node"
brew "nss"
brew "optipng"
brew "pandoc"
brew "parallel"
brew "pipx"
brew "pkg-config"
brew "python@3.12", link: true
brew "ripgrep"
brew "sass/sass/sass"
brew "trash"
brew "typst"
brew "wget2"
brew "woff2"
brew "zola"
