# vim: set syntax=ruby:

tap "homebrew/bundle"
tap "homebrew/services"

# brew "bat" # disabled until the dark-light mode pr is merged and released
brew "age"
brew "appstream" # needed for libadwaita
brew "brotli"
brew "cargo-binstall"
brew "cmake"
brew "coreutils"
brew "csvlens"
brew "curl"
brew "dbus"
brew "dos2unix"
brew "entr"
brew "ffmpeg"
brew "fish"
brew "gh"
brew "git"
brew "git-delta"
brew "graphicsmagick"
brew "gstreamer" # needed for libadwaita
brew "helix"
brew "jpegoptim"
brew "just"
brew "jq"
brew "less"
brew "lesspipe"
brew "libsass" # needed for libadwaita
brew "libzen" # needed for egui apps
brew "make"
brew "man-db"
brew "meson"
brew "mkcert"
brew "mprocs"
brew "neovim"
brew "node"
brew "nss"
brew "optipng"
brew "oxipng"
brew "parallel"
brew "pngcrush"
brew "podman"
brew "python@3.12", link: true
brew "ripgrep"
brew "sassc" # needed for libadwaita
brew "syncthing"
brew "trash"
brew "trunk"
brew "typst"
brew "uv"
brew "wget"
brew "wget2"
brew "woff2"
brew "zola"

cask "eloston-chromium"
cask "font-departure-mono"
cask "font-fira-code"
cask "font-inter"
cask "font-jetbrains-mono"
cask "font-vollkorn"
cask "qlmarkdown"
cask "servo"
